export const ITEM_DATA_V3 = [
    {
        "location": "부채시티",
        "itemList": [
            "몬스터볼 x10 -> 몬스터볼 x50",
            "상처약 x1 -> 자전거",
            "TM27 은혜갚기 -> TM54 칼등치기",
            "TM53 에너지볼",
            "기력의덩어리 x2 -> 구애스카프",
            "TM83 분발"
        ]
    },
    {
        "location": "19번도로",
        "itemList": [
            "상처약",
            "오랭열매 x5",
            "물의돌",
            "네스트볼 -> TM31 깨뜨리다",
            "달인의띠"
        ]
    },
    {
        "location": "산가지마을",
        "itemList": [
            "스피드업 -> 힘의머리띠",
            "상처약 x1",
            "상처약"
        ]
    },
    {
        "location": "20번도로",
        "itemList": [
            "마비치료제 -> 실크스카프",
            "몬스터볼 (다우징)",
            "몬스터볼",
            "복슝열매 x3 -> 대단한낚싯대",
            "수퍼볼",
            "해독제 -> 기적의씨",
            "크리티컬커터",
            "하트비늘 (다우징)",
            "자뭉열매 x2",
            "기력의덩어리",
            "이상한사탕",
            "과사열매 x2",
            "큰버섯 (다우징)",
            "TM01 손톱갈기 [*]"
        ]
    },
    {
        "location": "산가지목장",
        "itemList": [
            "상처약 -> 평온의방울",
            "TM41 엉겨붙기 -> TM05 울부짖기 [*]",
            "몬스터볼 -> 선제공격손톱",
            "마비치료제 -> 학습장치",
            "플러스파워 -> 조임밴드",
            "TM21 화풀이"
        ]
    },
    {
        "location": "트레이너스쿨",
        "itemList": [
            "디펜드업 -> 유류열매",
            "나무열매주스 x2"
        ]
    },
    {
        "location": "모란만시티",
        "itemList": [
            "수퍼볼 x2 -> 수퍼볼 x15",
            "화상치료제 -> 기합의머리띠",
            "포켓풀 -> 연막탄",
            "해독제 (다우징) -> 느림보꼬리 (다우징)",
            "몬스터볼 x5 -> 하이퍼볼 x3",
            "이상한사탕 -> TM36 오물폭탄",
            "TM09 베놈쇼크"
        ]
    },
    {
        "location": "모란만콤비나트",
        "itemList": [
            "잘-맞히기 -> TM94 바위깨기",
            "실크스카프 -> 박식안경",
            "진주 (다우징)",
            "TM46 도둑질 -> 멘탈허브",
            "TM59 불태우기 -> TM59 괴전파 [*]",
            "TM94 바위깨기 -> TM45 그로우펀치",
            "PP에이드 -> 초점렌즈",
            "수퍼볼",
            "수퍼볼 x5 -> TM47 로킥",
            "작은버섯 (다우징)"
        ]
    },
    {
        "location": "구름시티",
        "itemList": [
            "자전거 -> 행복의알",
            "이상한사탕",
            "빨간실",
            "학습장치 -> 드림볼 x30",
            "리프의돌, 불꽃의돌, 물의돌 중 하나",
            "물의돌, 천둥의돌, 불꽃의돌, 태양의돌, 달의돌, 리프의돌, 얼음의돌 중 하나",
            "퀵볼 x2 -> 퀵볼 x5",
            "타이마볼 x5",
            "가벼운돌 -> 충전지 [*]",
            "이펙트가드 -> 전기구슬",
            "PP에이드 -> 굵은뼈",
            "TM44 잠자기",
            "기력의조각 -> 업그레이드",
            "TM70 플래시 -> TM90 대타출동 [*]",
            "튼튼밀크 x1 -> 나무열매주스 x12",
            "TM45 그로우펀치 -> TM10 잠재파워",
            "진화의휘석",
            "목탄",
            "부적금화",
            "기적의씨 -> TM86 풀묶기",
            "벌레회피스프레이 -> 먹다남은음식",
            "검은안경",
            "TM76 벌레의저항 -> TM81 시저크로스",
            "TM88 쪼아대기 -> TM73 자이로볼 [*]"
        ]
    },
    {
        "location": "구름하수도",
        "itemList": [
            "TM19 개척하기",
            "휘어진스푼 -> 맹독구슬",
            "스페셜업 -> 휘어진스푼",
            "귀중한뼈",
            "TM84 독찌르기 -> TM23 퀵턴 [*]",
            "먹다남은음식 -> 검은진흙",
            "HM04 괴력",
            "하트비늘",
            "스페셜가드 -> 화염구슬",
            "맥스업 (다우징)",
            "독주얼 (다우징)",
            "금속파우더 -> 혜성조각",
            "골드스프레이 (다우징)",
            "금구슬 (다우징)",
            "하이퍼볼 (다우징)",
            "검은진흙 -> TM08 벌크업"
        ]
    },
    {
        "location": "고대샛길",
        "itemList": [
            "동굴탈출로프",
            "TM23 떨어뜨리기 -> TM39 암석봉인 [*]",
            "딱딱한돌",
            "골드스프레이",
            "타우린 -> TM85 치근거리기",
            "초록조각 (다우징)",
            "파랑조각 (다우징)",
            "골드스프레이 (다우징)",
            "빨강조각 (다우징)",
            "노랑조각 (다우징)",
            "바위주얼 (다우징)",
            "큰진주 -> TM52 기합구슬"
        ]
    },
    {
        "location": "4번도로",
        "itemList": [
            "포켓풀",
            "타우린 -> 생명의구슬",
            "신비의물방울 -> 고운비늘",
            "광각렌즈",
            "자뭉열매 x3 -> 자뭉열매 x5",
            "빨강조각 (다우징)",
            "고급상처약 (다우징)",
            "TM28 구멍파기",
            "별의모래",
            "별의모래 (다우징)",
            "노랑조각",
            "끈기갈고리손톱",
            "초록조각"
        ]
    },
    {
        "location": "리조트데저트",
        "itemList": [
            "TM82 열사의대지 [*]",
            "부드러운모래",
            "복분열매 x2",
            "별의조각 (다우징)",
            "심해의이빨 -> 축복받은갑옷 [*]",
            "파랑조각 (다우징)",
            "땅주얼 (다우징)",
            "빨강조각 -> TM03 사이코쇼크",
            "빨강조각 (다우징)",
            "심해의비늘 -> 저주받은갑옷 [*]",
            "실버스프레이 (다우징)",
            "금구슬 -> TM78 땅고르기",
            "하트비늘",
            "별의모래",
            "초록조각 -> 태양의돌",
            "PP회복",
            "불꽃의돌 (다우징)"
        ]
    },
    {
        "location": "고대의 성",
        "itemList": [
            "하트비늘 (다우징)",
            "TM39 암석봉인 -> TM84 독찌르기 [*]",
            "태양의돌 (다우징)",
            "TM01 손톱갈기 -> 부스트에너지S"
        ]
    },
    {
        "location": "뇌문시티",
        "itemList": [
            "태양의돌 -> 얼음의돌",
            "교정깁스",
            "빨강조각 x10",
            "평온의방울",
            "천둥의돌 (다우징)",
            "기력의조각 (다우징)",
            "마비치료제 -> 조개껍질방울",
            "TM72 볼트체인지",
            "TM49 에코보이스 -> TM49 사이코노이즈 [*]"
        ]
    },
    {
        "location": "16번도로",
        "itemList": [
            "힐볼 -> 각성의돌",
            "TM66 보복 -> TM66 파워젬",
            "작은버섯 (다우징)"
        ]
    },
    {
        "location": "미혹의 숲",
        "itemList": [
            "TM22 솔라빔 [*]",
            "TM57 솔라블레이드 [*]",
            "하이퍼볼 -> 리프의돌",
            "복슝열매",
            "리프의돌 (다우징)",
            "TM95 바크아웃",
            "넷트볼 -> 끈기갈고리손톱",
            "버치열매",
            "풀주얼 (다우징) -> 딱딱한돌"
        ]
    },
    {
        "location": "5번도로",
        "itemList": [
            "일렉트릭기타 -> 메트로놈",
            "고급상처약 -> TM43 니트로차지",
            "HM02 귀환",
            "실버스프레이",
            "고급상처약 (다우징)",
            "버치열매"
        ]
    },
    {
        "location": "물풍경도개교",
        "itemList": [
            "방패의화석 & 두개의화석"
        ]
    },
    {
        "location": "물풍경시티",
        "itemList": [
            "달인의띠",
            "하트비늘",
            "하이퍼볼",
            "리보플라빈 -> 연결의끈",
            "조개껍질방울",
            "하반열매",
            "검은철구 -> TM70 10만마력 [*]",
            "변함없는돌",
            "럭셔리볼 x3 -> 럭셔리볼 x10",
            "TM63 세차게휘두르기 -> TM63 DD래리어트 [*]",
            "풍선* 또는 연결의끈**",
            "귀중한뼈",
            "TM78 땅고르기 -> TM26 지진",
            "* 노말 모드 한정",
            "** 챌린지 모드 한정"
        ]
    },
    {
        "location": "PWT",
        "itemList": [
            "PP에이드 (다우징)",
            "울퉁불퉁멧",
            "키토산 (다우징)",
            "포인트업 -> TM79 매혹의보이스 [*]"
        ]
    },
    {
        "location": "6번도로",
        "itemList": [
            "PP에이더",
            "달의돌",
            "작은버섯 (다우징)",
            "하이퍼볼 -> 은빛가루",
            "타우린 (다우징)",
            "빛의돌",
            "복슝열매",
            "HM03 파도타기",
            "TM56 내던지기 -> TM20 트라이어택",
            "하트비늘",
            "포인트업 -> 왕의징표석",
            "큰버섯 (다우징)"
        ]
    },
    {
        "location": "전기돌동굴",
        "itemList": [
            "자석",
            "만병통치제",
            "노랑조각 (다우징)",
            "골드스프레이",
            "고급상처약 -> TM77 자기암시",
            "고급상처약 (다우징)",
            "금구슬",
            "큰금구슬",
            "하이퍼볼 (다우징)",
            "유루열매 x2",
            "알칼로이드 -> 빛의점토",
            "알칼로이드 (다우징)",
            "기력의조각 -> TM91 러스터캐논",
            "사포닌 -> 충전지",
            "천둥의돌",
            "금속코트",
            "전기주얼 (다우징) -> 딱딱한돌",
            "복합금속 [*]",
            "부스트에너지V"
        ]
    },
    {
        "location": "야콘로드",
        "itemList": [
            "리샘열매 x2",
            "빨강조각 -> TM64 대폭발",
            "파랑조각 (다우징)",
            "초록조각 -> 발톱화석",
            "만병통치제",
            "귀중한뼈 -> 뿌리화석",
            "강철주얼 (다우징)",
            "맥스업 -> 조개화석",
            "금구슬 -> 껍질화석",
            "물의돌 (다우징)",
            "금속코트",
            "기력의덩어리 -> 영계의천",
            "사포닌 (다우징)",
            "큰금구슬 (다우징)"
        ]
    },
    {
        "location": "궐수의 동굴",
        "itemList": [
            "다크볼 -> TM82 드래곤테일",
            "노랑조각 -> 연결의끈",
            "실버스프레이 (다우징)",
            "고급상처약 -> 용의이빨",
            "초록조각 (다우징)",
            "하이퍼볼 (다우징)",
            "파랑조각 -> 용의비늘",
            "동굴탈출로프",
            "만병통치제 (다우징)",
            "TM80 스톤샤워",
            "드래곤주얼 (다우징) -> 딱딱한돌"
        ]
    },
    {
        "location": "궐수시티",
        "itemList": [
            "예리한부리",
            "TM58 폭풍 -> 탈출버튼",
            "TM40 제비반환",
            "마스터볼",
            "골드스프레이",
            "비행주얼 (다우징) -> 딱딱한돌",
            "사포닌 (다우징)",
            "TM62 애크러뱃"
        ]
    },
    {
        "location": "7번도로",
        "itemList": [
            "TM81 시저크로스 -> TM89 유턴",
            "키토산 -> 왕의징표석",
            "리프의돌",
            "PP에이더",
            "작은버섯 (다우징)",
            "기력의조각 (다우징)"
        ]
    },
    {
        "location": "태엽산 입구",
        "itemList": [
            "피트블록 [*]"
        ]
    },
    {
        "location": "타워오브해븐",
        "itemList": [
            "행복의알",
            "고급상처약 -> 멘탈허브",
            "TM61 도깨비불",
            "기력의조각 -> 연결의끈",
            "괴상한향로 -> 기력의덩어리 [*]",
            "TM65 섀도크루",
            "고스트주얼 (다우징) -> 딱딱한돌",
            "악의족자 [*]",
            "물의족자 [*]"
        ]
    },
    {
        "location": "산로마을",
        "itemList": [
            "불꽃의돌",
            "TM57 차지빔 -> TM24 10만볼트",
            "저주의부적 -> 순결의부적"
        ]
    },
    {
        "location": "리버스마운틴",
        "itemList": [
            "골드스프레이",
            "TM69 록커트 -> TM69 나쁜음모 [*]",
            "PP에이더 (다우징)",
            "고급상처약",
            "별의조각",
            "포인트업",
            "기력의조각",
            "리보플라빈 (다우징)",
            "TM54 칼등치기 -> TM27 은혜갚기",
            "금구슬",
            "시몬열매",
            "파랑조각 (다우징)",
            "초록조각 (다우징)",
            "맹독구슬 -> TM35 화염방사",
            "시몬열매",
            "물주얼 (다우징) -> 딱딱한돌"
        ]
    },
    {
        "location": "스트레인저 하우스",
        "itemList": [
            "TM30 섀도볼 -> 아름다운허물",
            "저주의부적",
            "만병통치제 -> TM30 섀도볼",
            "어둠의돌",
            "초승달날개",
            "이상한사탕"
        ]
    },
    {
        "location": "물결마을",
        "itemList": [
            "HM05 폭포오르기",
            "HM06 다이빙 -> 마스터볼",
            "빛의돌 (다우징)",
            "나무열매쥬스 -> TM55 열탕",
            "하트비늘 (다우징)",
            "진주 x2 (다우징)",
            "큰진주 (다우징)"
        ]
    },
    {
        "location": "물결만",
        "itemList": [
            "용의플레이트",
            "하트비늘 (다우징)",
            "물방울플레이트"
        ]
    },
    {
        "location": "14번도로",
        "itemList": [
            "큰진주",
            "풀회복약",
            "하트비늘 -> 느림보꼬리",
            "타우린 (다우징)",
            "금구슬",
            "금구슬 (다우징)"
        ]
    },
    {
        "location": "풍요의 사당",
        "itemList": [
            "리보플라빈 (다우징)",
            "작은버섯 (다우징)",
            "빛의돌",
            "기력의덩어리 -> 고급상처약",
            "TM60 순서미루기 -> TM60 인파이트 [*]",
            "큰버섯 (다우징)",
            "힐볼 -> 연결의끈",
            "포인트맥스 (다우징)",
            "이상한사탕"
        ]
    },
    {
        "location": "13번도로",
        "itemList": [
            "파랑조각",
            "PP회복",
            "자뭉열매 x2",
            "진주 (다우징)",
            "큰진주 (다우징)",
            "빨강조각 -> 반짝가루",
            "키토산 (다우징)",
            "골드스프레이",
            "하트비늘 (다우징)",
            "하이퍼볼",
            "별의조각",
            "TM29 사이코키네시스",
            "럭셔리볼 -> TM76 벌레의야단법석",
            "고급상처약 -> TM32 매지컬샤인",
            "하트비늘 (다우징)",
            "파워렌즈/파워밴드 -> TM48 매지컬플레임"
        ]
    },
    {
        "location": "보배마을",
        "itemList": [
            "메트로놈 -> TM04 명상",
            "만병통치제 -> TM56 웨더볼"
        ]
    },
    {
        "location": "12번도로",
        "itemList": [
            "골드스프레이 (다우징)",
            "이상한사탕 (다우징)",
            "하이퍼볼 (다우징)",
            "노랑조각 -> 독바늘",
            "포인트업",
            "타이마볼",
            "초록조각 -> 대파",
            "풀회복약 -> TM93 와일드볼트"
        ]
    },
    {
        "location": "빌리지 브리지",
        "itemList": [
            "알칼로이드",
            "이상한사탕",
            "큰버섯 (다우징)",
            "PP회복 (다우징)",
            "포인트업 (다우징)",
            "하이퍼볼 -> 마그마부스터",
            "하트비늘 -> 에레키부스터",
            "자뭉열매 x5",
            "파랑조각 -> 검은띠"
        ]
    },
    {
        "location": "11번도로",
        "itemList": [
            "배리열매 x2",
            "애호메일 -> 큰뿌리",
            "만병통치제",
            "풀회복약 (다우징)",
            "키토산 -> TM75 칼춤",
            "맥스업 (다우징)",
            "예리한이빨"
        ]
    },
    {
        "location": "쌍용시티",
        "itemList": [
            "덮개화석 & 날개화석",
            "가벼운돌 -> 구근",
            "겨냥표적",
            "연막탄 -> 괴상한패치",
            "TM82 드래곤테일 -> TM02 드래곤크루"
        ]
    },
    {
        "location": "9번도로",
        "itemList": [
            "삐삐인형 -> TM87 락클라임",
            "퀵볼",
            "PP에이더",
            "금구슬",
            "사포닌 -> TM34 오물웨이브",
            "악주얼 (다우징)",
            "맥스업"
        ]
    },
    {
        "location": "마린튜브",
        "itemList": [
            "TM42 객기"
        ]
    },
    {
        "location": "기하시티",
        "itemList": [
            "하트비늘 -> 신비의물방울",
            "하트비늘 (다우징)",
            "TM17 방어",
            "타우린",
            "바닷물향로 -> 기력의덩어리 [*]",
            "진주",
            "기력의조각 -> 축축한바위",
            "회복약 (다우징)",
            "TM55 열탕 -> TM51 웨이브태클"
        ]
    },
    {
        "location": "플라스마 프리깃",
        "itemList": [
            "기력의조각",
            "TM67 트리플악셀 [*]",
            "마그마부스터 -> TM92 트릭룸",
            "키토산",
            "기력의덩어리 -> 레드카드",
            "PP맥스 -> 탈출버튼",
            "파워밴드/파워벨트 -> 포커스렌즈",
            "마스터볼"
        ]
    },
    {
        "location": "22번도로",
        "itemList": [
            "알칼로이드 (다우징)",
            "포인트업",
            "초록조각 (다우징)",
            "이상한사탕",
            "리보플라빈 -> 뜨거운바위",
            "독바늘",
            "풀회복약",
            "빨강조각"
        ]
    },
    {
        "location": "21번수로",
        "itemList": [
            "큰진주",
            "포인트업"
        ]
    },
    {
        "location": "해변동혈",
        "itemList": [
            "TM06 맹독",
            "시몬열매 x2",
            "회복약",
            "파랑조각 (다우징)",
            "다이브볼",
            "하트비늘",
            "리보플라빈 (다우징)",
            "골드스프레이",
            "이상한사탕"
        ]
    },
    {
        "location": "자이언트홀",
        "itemList": [
            "노랑조각",
            "달의돌 (다우징)",
            "풀회복약 (다우징)",
            "TM13 냉동빔",
            "별의조각",
            "별의조각 -> 녹지않는얼음",
            "골드스프레이",
            "하이퍼볼",
            "얼음주얼 (다우징) -> 딱딱한돌",
            "기력의덩어리 x3",
            "예리한손톱",
            "달의돌",
            "TM03 사이코쇼크 -> TM90 대타출동",
            "별의조각",
            "포인트업",
            "알칼로이드",
            "태양의돌"
        ]
    },
    {
        "location": "23번도로",
        "itemList": [
            "하트비늘",
            "풀회복약 -> TM50 오버히트",
            "이상한사탕 (다우징)",
            "사포닌",
            "별의조각 (다우징)",
            "별의조각",
            "자뭉열매 x2",
            "TM05 울부짖기 -> TM41 기습 [*]",
            "하이퍼볼 (다우징)",
            "리피드볼",
            "맥스업",
            "리보플라빈",
            "만병통치제",
            "노랑조각 (다우징)",
            "초록조각",
            "TM35 화염방사 -> 검은띠",
            "포인트업 (다우징)",
            "TM12 도발"
        ]
    },
    {
        "location": "챔피언로드",
        "itemList": [
            "HM05 폭포오르기 -> 오래된해도",
            "포인트업 -> TM58 폭풍",
            "별의조각 -> 프로텍터",
            "사포닌 (다우징)",
            "어둠의돌 (다우징)",
            "TM01 손톱갈기 -> TM46 파동탄",
            "하이퍼볼 x2",
            "골드스프레이 x2",
            "회복약 x2",
            "회복약 (다우징)",
            "동굴탈출로프",
            "TM93 와일드볼트 -> TM71 스톤에지",
            "기력의덩어리",
            "기력의덩어리 (다우징)",
            "빨강조각 (다우징)",
            "포인트맥스 -> 영계의천",
            "PP맥스",
            "PP맥스 (다우징)",
            "이상한사탕",
            "이상한사탕 (다우징)",
            "용의비늘",
            "노말주얼 (다우징) -> 딱딱한돌",
            "버치열매",
            "복분열매",
            "용의이빨",
            "TM24 10만볼트 -> HM06 다이빙"
        ]
    },
    {
        "location": "실린더 브리지",
        "itemList": [
            "TM43, 니트로차지 -> 구애머리띠"
        ]
    },
    {
        "location": "8번도로",
        "itemList": [
            "뜨거운바위",
            "보송보송바위",
            "차가운바위",
            "네스트볼",
            "큰진주",
            "골드스프레이 (다우징)",
            "이상한사탕 (다우징)",
            "TM36, 오물폭탄 -> 구애스카프"
        ]
    },
    {
        "location": "설화의 습지초원",
        "itemList": [
            "리샘열매 x2",
            "TM84, 독찌르기 -> 맹독구슬",
            "작은버섯  (다우징)",
            "각성의돌 (다우징)",
            "만병통치제",
            "큰버섯 (다우징)",
            "이상한사탕",
            "초록조각",
            "하트비늘"
        ]
    },
    {
        "location": "15번도로",
        "itemList": [
            "PP맥스",
            "TM26, 지진 -> TM20, 트라이어택",
            "맥스업 (다우징)",
            "풀회복약",
            "하이퍼볼 (다우징)"
        ]
    },
    {
        "location": "용나선탑",
        "itemList": [
            "녹지않는얼음",
            "숲의양갱",
            "알칼로이드",
            "빨강조각 (다우징)",
            "PP에이더",
            "하이퍼볼",
            "빛의돌",
            "타우린",
            "금강옥",
            "백옥",
            "백금옥",
            "포인트맥스",
            "기력의덩어리",
            "TM02 드래곤크루 -> 구애안경",
            "혜성조각",
            "혜성조각 (다우징)"
        ]
    },
    {
        "location": "바람개비숲",
        "itemList": [
            "TM22 솔라빔 -> TM51 웨이브태클",
            "이상한사탕 (다우징)",
            "하이퍼볼",
            "하이퍼볼 (다우징)",
            "자뭉열매 x2",
            "골드스프레이",
            "기력의덩어리",
            "리샘열매 x2",
            "넷트볼",
            "향기버섯 (다우징)",
            "업그레이드",
            "TM86 풀묶기 -> 리프의돌",
            "초록조각 (다우징)",
            "벌레주얼 (다우징) -> 딱딱한돌",
            "태양의돌",
            "포인트맥스",
            "네스트볼 x5",
            "하이퍼볼 (다우징)",
            "만병통치제",
            "PP맥스 (다우징)",
            "포인트맥스",
            "격투주얼 (다우징) -> 딱딱한돌",
            "금구슬",
            "별의모래",
            "맥스업"
        ]
    },
    {
        "location": "N의 성",
        "itemList": [
            "럭셔리볼",
            "타우린",
            "TM50 오버히트 -> 화염구슬"
        ]
    },
    {
        "location": "지하수맥굴",
        "itemList": [
            "골드스프레이",
            "동굴탈출로프",
            "TM47 로킥 -> 연결의끈",
            "TM52 기합구슬 -> 어둠의돌",
            "알칼로이드 (다우징)",
            "프로텍터",
            "기력의덩어리",
            "기력의덩어리 (다우징)",
            "하이퍼볼 (다우징)"
        ]
    },
    {
        "location": "태엽산",
        "itemList": [
            "조개화석",
            "껍질화석",
            "비밀의호박",
            "뿌리화석",
            "발톱화석",
            "두개의화석",
            "방패의화석",
            "다크볼",
            "TM71 스톤에지 -> 얼음의돌",
            "TM91 러스터캐논 -> TM77 자기암시",
            "TM90 대타출동 -> 빛의돌",
            "귀중한뼈",
            "귀중한뼈 (다우징)",
            "회복약",
            "회복약 (다우징)",
            "어둠의돌",
            "가벼운돌",
            "빨강조각",
            "하이퍼볼 (다우징)",
            "노랑조각 (다우징)",
            "탈출버튼",
            "이상한사탕 (다우징)",
            "큰금구슬"
        ]
    },
    {
        "location": "3번도로",
        "itemList": [
            "퀵볼",
            "키토산",
            "큰금구슬",
            "하이퍼볼 (다우징)",
            "하이퍼볼",
            "리보플라빈",
            "회복약",
            "금구슬 (다우징)",
            "이상한사탕 (다우징)",
            "이상한사탕",
            "다이브볼 x5"
        ]
    },
    {
        "location": "성신시티",
        "itemList": [
            "그라시데아꽃",
            "큰진주",
            "다크볼 x5",
            "타이마볼",
            "수퍼볼",
            "업그레이드",
            "포인트업 (다우징)",
            "회복약 (다우징)",
            "PP맥스",
            "노랑조각",
            "시몬열매 x3",
            "큰버섯"
        ]
    },
    {
        "location": "꿈터",
        "itemList": [
            "이상한사탕",
            "TM85 꿈먹기 -> TM85 치근거리기",
            "하이퍼볼",
            "달의돌",
            "포인트업 (다우징)",
            "영계의천",
            "맥스업",
            "각성의돌",
            "사포닌",
            "에스퍼주얼 (다우징)"
        ]
    },
    {
        "location": "2번도로",
        "itemList": [
            "만병통치제",
            "리피드볼 -> 고급상처약",
            "리보플라빈",
            "각성의돌",
            "포인트맥스 (다우징)",
            "기력의덩어리",
            "기력의덩어리 (다우징)",
            "알칼로이드",
            "하이퍼볼"
        ]
    },
    {
        "location": "넝쿨마을",
        "itemList": [
            "몬스터볼 x10",
            "향기버섯",
            "풀주얼 -> 딱딱한돌",
            "불꽃주얼 -> 딱딱한돌",
            "물주얼 -> 딱딱한돌",
            "삐삐인형",
            "에나비꼬리",
            "메트로놈",
            "자뭉열매",
            "리샘열매",
            "골드스프레이 (다우징)"
        ]
    },
    {
        "location": "1번도로",
        "itemList": [
            "상처약",
            "하이퍼볼 (다우징)",
            "회복약",
            "리샘열매 x2",
            "고운비늘",
            "타우린 (다우징)"
        ]
    },
    {
        "location": "마름꽃마을",
        "itemList": [
            "키토산 (다우징)",
            "왕의징표석",
            "나무열매쥬스",
            "허가증",
            "둥근부적",
            "빛나는부적",
            "대단한낚싯대 -> 성스러운분말"
        ]
    },
    {
        "location": "17번수로",
        "itemList": [
            "파랑조각",
            "파랑조각 (다우징)",
            "다이브볼",
            "경단진주",
            "여울소금 (다우징)",
            "여울조개껍질 (다우징)"
        ]
    },
    {
        "location": "18번도로",
        "itemList": [
            "진주 (다우징)",
            "경단진주 (다우징)",
            "키토산",
            "이상한사탕 (다우징)",
            "별의조각",
            "TM19 텔레키네시스 -> TM19 개척하기",
            "화산의돌",
            "하트비늘 (다우징)",
            "사포닌",
            "포인트맥스",
            "포인트맥스 (다우징)",
            "고운비늘 (다우징)"
        ]
    }
]